cmsis-svd/cmsis-svd/data/Spansion/MB9AF14xN.svd
        <!-- REGISTER "SPSR" -->
        <register>
          <name>SPSR</name>
          <description>Special port setting register</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000005</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MAINXC" -->
            <field>
              <name>MAINXC</name>
              <description>Main clock(oscillation) pin setting bit</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SUBXC" -->
            <field>
              <name>SUBXC</name>
              <description>Sub clock(oscillation) pin setting bit</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR00" -->
        <register>
          <name>EPFR00</name>
          <description>Extended pin function setting register 00</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00030000</resetValue>
          <resetMask>0x030300F7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRC1E" -->
            <field>
              <name>TRC1E</name>
              <description>TRACED function select bit1</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRC0E" -->
            <field>
              <name>TRC0E</name>
              <description>TRACED function select bit0</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "JTAGEN1S" -->
            <field>
              <name>JTAGEN1S</name>
              <description>JTAG function select bit1</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "JTAGEN0B" -->
            <field>
              <name>JTAGEN0B</name>
              <description>JTAG function select bit0</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SUBOUTE" -->
            <field>
              <name>SUBOUTE</name>
              <description>Sub clock divide output function select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTCCOE" -->
            <field>
              <name>RTCCOE</name>
              <description>RTC clock output select bit </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CROUTE" -->
            <field>
              <name>CROUTE</name>
              <description>Internal high-speed CR oscillation output function select bit</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NMIS" -->
            <field>
              <name>NMIS</name>
              <description>NMIX function select bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR04" -->
        <register>
          <name>EPFR04</name>
          <description>Extended pin function setting register 04</description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F3C3F7C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB3S" -->
            <field>
              <name>TIOB3S</name>
              <description>TIOB3 input select bit</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA3E" -->
            <field>
              <name>TIOA3E</name>
              <description>TIOA3E output select bit</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA3S" -->
            <field>
              <name>TIOA3S</name>
              <description>TIOA3 input select bit</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB2S" -->
            <field>
              <name>TIOB2S</name>
              <description>TIOB2 input select bit</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA2E" -->
            <field>
              <name>TIOA2E</name>
              <description>TIOA2 output select bit</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB1S" -->
            <field>
              <name>TIOB1S</name>
              <description>TIOB1 input select bit</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA1E" -->
            <field>
              <name>TIOA1E</name>
              <description>TIOA1E output select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA1S" -->
            <field>
              <name>TIOA1S</name>
              <description>TIOA1 input select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB0S" -->
            <field>
              <name>TIOB0S</name>
              <description>TIOB0 input select bit</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA0E" -->
            <field>
              <name>TIOA0E</name>
              <description>TIOA0 output select bit</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR05" -->
        <register>
          <name>EPFR05</name>
          <description>Extended pin function setting register 05</description>
          <addressOffset>0x614</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F3C3F3C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB7S" -->
            <field>
              <name>TIOB7S</name>
              <description>TIOB7 input select Bit</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA7E" -->
            <field>
              <name>TIOA7E</name>
              <description>TIOA7E output select bit</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA7S" -->
            <field>
              <name>TIOA7S</name>
              <description>TIOA7 input select bit</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB6S" -->
            <field>
              <name>TIOB6S</name>
              <description>TIOB6 input select bit</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA6E" -->
            <field>
              <name>TIOA6E</name>
              <description>TIOA6 output select bit</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB5S" -->
            <field>
              <name>TIOB5S</name>
              <description>TIOB5 input select bit</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA5E" -->
            <field>
              <name>TIOA5E</name>
              <description>TIOA5E output select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA5S" -->
            <field>
              <name>TIOA5S</name>
              <description>TIOA5 input select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB4S" -->
            <field>
              <name>TIOB4S</name>
              <description>TIOB4 input select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA4E" -->
            <field>
              <name>TIOA4E</name>
              <description>TIOA4 output select bit</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
